src/main/resources/temp_system_api_wsdl.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.example.org/temp_system_api_wsdl/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="temp_system_api_wsdl" targetNamespace="http://www.example.org/temp_system_api_wsdl/" xmlns:xsd1="http://www.mulesoft.com/schemas/Mule/Schema.xsd">
  <wsdl:types>
    <xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    	<xsd:import
    		namespace="http://www.mulesoft.com/schemas/Mule/Schema.xsd"
    		schemaLocation="loanSchema.xsd">
    	</xsd:import></xsd:schema></wsdl:types>
  <wsdl:message name="getTempRequest">
    <wsdl:part element="xsd1:getTempRequest" name="parameters"/>
  </wsdl:message>
  <wsdl:message name="getTempResponse">
    <wsdl:part element="xsd1:getTempResponse" name="parameters"/>
  </wsdl:message>
  <wsdl:portType name="temp_system_api_wsdl">
    <wsdl:operation name="getTemp">
      <wsdl:input message="tns:getTempRequest"/>
      <wsdl:output message="tns:getTempResponse"/>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="temp_system_api_wsdlSOAP" type="tns:temp_system_api_wsdl">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="getTemp">
      <soap:operation soapAction=""/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="temp_system_api_wsdl">
    <wsdl:port binding="tns:temp_system_api_wsdlSOAP" name="temp_system_api_wsdlSOAP">
      <soap:address location="http://localhost:8081/bank/temp?wsdl"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
